// Author: Freddyfre
// Version: 6.1.0.0 (04.01.2020)

// General

000 = Italiano
001 = Si
002 = No
003 = OK
004 = Esci
005 = Pannello principale
006 = Pannello Regole
007 = Apri il programma che desideri consentire
008 = Apri il programma che desideri bloccare
009 = Fare click sulla finestra del programma per consentire
010 = Fare click sulla finestra del programma per bloccare
011 = O fare click qui per annullare questa operazione
012 = Una nuova regola è stata creata per consentire tutte le connessioni per
013 = Una nuova regola è stata creata per bloccare tutte le connessioni per
016 = La regola attuale viene importata con successo da
017 = La regola attuale viene esportata con successo
018 = Ripristinato correttamente il metodo predefinito.
021 = Specificare il percorso completo del file che questa regola corrisponde
022 = Una regola parziale è stata importata con successo da
023 = Una regola parziale è stata esportata con successo
024 = Impossibile importare il file dei criteri
025 = Impossibile esportare il file dei criteri
028 = Profilo
029 = Ottieni maggiori informazioni
030 = Bloccare la configurazione corrente del programma
031 = Sbloccare la configurazione corrente del programma
032 = Bloccare
033 = Sbloccare
034 = Cancella
035 = Si prega di impostare la password
036 = Inserire la password per sbloccare
037 = Password errata
038 = La password non deve essere vuota
039 = Apri il sito web
040 = Gestisci le regole di Windows Firewall
042 = Sei sicuro di voler disattivare la protezione di Windows Firewall?
043 = Non mostrare più
044 = Sola lettura
045 = Regole in entrata con EdgeTraversal impostato su 'Rimanda all'utente' supportano solo la personalizzazione limitata, quindi alcune proprietà saranno disabilitate. Vuoi continuare?
046 = Sei sicuro di voler cancellare queste regole?
050 = Proprietà estese
051 = Questa regola contiene proprietà extra che sono configurabili solo da WFwAS
52 = Contare
053 = Nessuno
060 = Aggiorna le impostazioni
061 = Aggiornamento automatico attivo
070 = Dashboard
071 = Prova Malwarebytes Premium
072 = Apri Malwarebyte
073 = Stato Windows Firewall 
074 = On
075 = Off
076 = Connessioni in entrata
077 = Connessioni in uscita
078 = Consentire tutto
079 = Consentire
080 = Blocca
081 = Blocca tutto

// Tab items

100 = Profili
200 = Notifiche
300 = Opzioni
400 = Regole
500 = Criteri
600 = Informazioni

// Profiles

101 = Il livello di filtraggio specifica quali connessioni devono essere bloccate o che devono essere consentite
102 = Filtro alto
103 = Tutte le connessioni in uscita e in entrata sono bloccate. Questo profilo blocca tutti i tentativi di connessione da e verso il computer.
104 = Filtro medio (Raccomandato)
105 = Connessioni in uscita che non corrispondono a una regola sono bloccate. Sono ammessi solo i programmi con una regola autorizzata.
106 = Filtro basso
107 = Connessioni in uscita che non corrispondono a una regola sono ammesse. Sono bloccati solo i programmi con una regola di blocco.
108 = Filtro disattivato
109 = Windows Firewall disattivato. Evitare di utilizzare questa impostazione se non si dispone di un altro firewall in esecuzione.
110 = Filtro medio
111 = Specificare il profilo che sarà ripristinato nel caso si passi a un profilo di filtraggio inferiore per l'installazione/aggiornamento
112 = Imposta automaticamente
113 = dopo
114 = minuti

// Notifications

201 = Notifiche modalità specifica che bloccavano le connessioni in uscita devono essere visualizzate per l'utente
204 = Visualizza notifiche
205 = Visualizzazione le notifiche per tutte le connessioni in uscita bloccate, ma non le mostra per i programmi definiti come le eccezioni riportate di seguito
206 = Modalità di apprendimento
207 = Crea automaticamente regole in uscita per consentire programmi con firma digitale e visualizza notifiche solo per i programmi non firmati
208 = Disattivo
209 = Non visualizza notifiche.
210 = Opzioni per le notifiche
211 = Chiudere automaticamente una notifica in
212 = secondi.
213 = Timeout personalizzato per regole transitorie è
214 = Riprodurre un suono quando viene generata una nuova notifica
215 = Riproduci suono di default
216 = Riproduci suono personalizzato
217 = Si prega di selezionare un suono di notifica personalizzato
218 = Sistema di notifiche disponibile solo per gli utenti registrati. Per poter utilizzare questa funzione è necessario abilitare il programma. Grazie per il vostro sostegno.
219 = Click qui per scoprire come diventare un utente registrato
220 = Visualizza notifiche sopra ad altre finestre
221 = Impostazioni notifiche avanzate
222 = Ripristina impostazioni predefinite avanzate
223 = Usa consentire regole per la ricerca di regole di corrispondenza. Consigliato per la compatibilità con gli altri programmi di sicurezza se vengono visualizzate le notifiche duplicate.
224 = Usa regole di blocco generico durante la ricerca di regole di corrispondenza. Se una regola di blocco si applica a tutti i programmi in base al collegamento bloccato, non verranno visualizzate le notifiche.
225 = Usa regole disattivate nella ricerca di regole di corrispondenza. Se viene trovata una regola corrispondente disattivata non verranno visualizzate le notifiche.
230 = Regola creata da modalità di apprendimento
240 = Definire di seguito le cartelle e i programmi per i quali le notifiche non deve essere visualizzate
241 = Notifiche eccezioni
242 = Aggiungi eccezione
243 = Rimuovere eccezione
244 = Definire una nuova eccezione
245 = Aggiungere le notifiche eccezioni
246 = Escludi file
247 = Escludere cartella

// Options

301 = Specificare di seguito le opzioni da applicare per tutti gli account del computer locale
302 = Integrazione della shell
303 = Integrare il programma nel menu contestuale dei file eseguibili e le scorciatoie dei file eseguibili.
304 = Avvia automaticamente all'accesso dell'utente
305 = Quando si utilizza la funzione Cambio Rapido Utente, questa opzione si applica per il primo accesso dell'utente.
308 = HotKeys globali
309 = HotKeys globali sono le scorciatoie da tastiera che puoi utilizzare da qualsiasi applicazione in esecuzione.
321 = Profilo Filtro Alto è attivato. Tutte le connessioni di rete sono bloccate fino a quando il profilo viene modifivato manualmente.
324 = Importa, esporta o ripristina le impostazioni utente
325 = Importare le impostazioni utente da un file
326 = Esporta le impostazioni dell'utente in un file
327 = Ripristina tutte le impostazioni ai valori di default
328 = Impostazioni utente sono state esportate con successo in
329 = Dopo la conferma di questa azione, il programma si riavvia in modo di ricaricare tutte le impostazioni. Sei sicuro di voler continuare?
330 = Consenti attraverso Windows Firewall
331 = Blocca tramite Windows Firewall
340 = Interfaccia Lingua utente

// Rules

401 = Specifica la direzione per la quale viene applicata una nuova regola quando si crea una nuova regola:
402 = Regole in uscita (Raccomandato)
403 = Per impostazione predefinita crea solo regole in uscita durante la creazione di nuove regole per consentire o bloccare le applicazioni.
404 = Regole in entrata
405 = Per impostazione predefinita crea solo regole in entrata. Utilizzare questa opzione con cautela. Accesso in ingresso di solito serve per le applicazioni server.
406 = Regole in uscita e in entrata
407 = Per impostazione predefinita crea entrambi i tipi di regole. Non consigliato.
408 = Specifica le posizioni per le quali si applica una nuova regola quando si crea una nuova regola:
409 = Importa, esporta o ripristina le regole del firewall
410 = Importa le regole di Windows Firewall da un file
411 = Esporta le regole di Windows Firewall in un file
412 = Ripristina le regole predefinite di Windows Firewall.
413 = Ripristina la configurazione di Windows Firewall Control con le regole raccomandate
414 = Importa le regole del firewall da un file, sovrascriverà tutte le attuali regole di Windows Firewall. Se si desidera salvare una copia delle regole attuali, si deve prima di esportarle in un file. Vuoi importare le regole del firewall da un file ora?
415 = Ripristina il set predefinito di regole si azzerano tutte le modifiche alle impostazioni di Windows Firewall che hai fatto da quando hai installato Windows. In alcuni casi questo causa che alcuni programmi smettano di lavorare. Vuoi continuare?
416 = Importa da un file...
417 = Esporta in un file...
418 = WFC consiglia regole che erano state create con successo.
419 = Si prega di aggiornare le regole nella finestra del pannello Regole . Grazie.
420 = Questa azione cancellerà le attuali informazioni dal registro di Windows Firewall. Sei sicuro di voler continuare?
421 = Un file con una regola parziale è stato selezionato. Importazione di regole del firewall da questo file lascerà le regole attuali invariate e le regole contenute in questo file verrà aggiunto al vostro set corrente di regole. Vuoi importare le regole del firewall dal file selezionato?
422 = Il file non è accessibile o ha un formato non valido!
423 = Ripristino regole di WFC raccomandate ricreare di nuovo queste regole. Le attuali norme esistenti rimarranno invariate. Vuoi continuare?

// Security

450 = Sicurezza
451 = Specificare sotto i miglioramenti di sicurezza che verranno applicati da Windows Firewall Control
452 = Avvio protetto
453 = Impostare automaticamente il profilo di filtrazione allo spegnimento del sistema. All'avvio di Windows le connessioni di rete verranno bloccate fino a quando l'utente non cambierà manualmente il profilo.
454 = Regole sicure
455 = Proteggi le regole di Windows Firewall da manomissioni esterne. Quando questa funzione è abilitata, l'aggiunta, la modifica o la rimozione delle regole del firewall possono essere eseguite solo tramite questo software.
456 = Prima di abilitare questa funzione per favore consultare il manuale dell'utente per comprendere gli effetti e gli effetti collaterali di questo. Sei davvero sicuro di voler continuare?
458 = Rimuovi gruppo
459 = Definire qui un nuovo gruppo autorizzato
460 = Attenzione. Tutte le regole del firewall, tra cui Windows Firewall regole di default, che hanno il nome di gruppo diverso da quello dei gruppi autorizzati definiti verranno cancellati o disabili. Si raccomanda la creazione di una copia di backup delle regole attuali. Sei sicuro di voler continuare?
461 = Importa nomi gruppi dalle regole esistenti
462 = Regole non autorizzate sono automaticamente
463 = cancellate
464 = disabilitate
465 = Usa un singolo @ per escludere le regole del firewall definite per applicazioni Windows 10
466 = Sono state rilevate regole senza un gruppo definito. Per garantirne la conservazione, vuoi aggiungere queste regole al gruppo di Windows Firewall Control prima di abilitare regole sicure?
467 = Autorizza gruppo 
470 = Profilo sicuro
471 = Proteggi lo stato di Windows Firewall da manomissioni esterne. Quando questa funzione è abilitata, l'importazione delle regole del firewall e la modifica della modalità di filtro possono essere eseguite solo tramite questo software.
475 = Elimina regole non autorizzate
476 = Disabilita regole non autorizzate
477 = Consentire le regole di Windows Store

// Tools

501 = Utilizza i tasti di scelta rapida qui sotto per lanciare varie utility di sistema. Si noti che questi programmi vengono eseguiti con i privilegi maggiormente elevati disponibili.
502 = Windows Firewall con Protezione Avanzata
503 = Visualizzatore eventi
504 = Monitoraggio risorse
505 = Pannello Controllo di Windows Firewall
510 = Specificare sotto i servizi di URL utilizzati per varie verifiche on-line
511 = URL per controllare la reputazione di un indirizzo IP 
512 = URL per controllare un file basato su hash SHA256 del file
513 = URL per avviare una ricerca WHOIS
514 = URL per saperne di più su una porta specifica
520 = Copia ...
521 = Tutti

// About

601 = Informazioni sul programma
602 = Verifica se è disponibile una nuova versione 
603 = Impossibile connettersi al server di aggiornamento. Assicuratevi di avere la regola necessaria per consentire le connessioni di questo programma e una configurazione proxy corretta, se necessario.
604 = Impossibile connettersi. Proxy autenticazione necessario ma il programma non lo supporta. Si prega di controllare manualmente gli aggiornamenti, visitare il sito web. Grazie.
605 = Stai utilizzando la versione finale. Nessuna nuova versione disponibile in questo momento.
606 = Una nuova versione di Windows Firewall Control è disponibile
607 = Vuoi scaricare l'aggiornamento di questa nuova versione?
608 = Visualizza modifiche
609 = Stato di attivazione
610 = Tutti i diritti riservati.
611 = Avvisi di terzi
612 = Contratto di licenza con l'utente finale (EULA)
613 = Click qui per attivare
614 = Di seguito viene riportato l'ID d'installazione generato automaticamente durante l'installazione di questo programma. Si prega di inserire nella casella di testo qui sotto il codice d'attivazione corrispondente e premere sul pulsante Attiva per completare l'attivazione del prodotto. Per ottenere il codice d'attivazione corrispondente, fai il login con il tuo account al nostro sito.
615 = Click qui per aprire la pagina di login
616 = ID d'installazione
617 = Codice d'attivazione
618 = Attiva
619 = Copia nella clipboard
620 = Incolla da clipboard
621 = Tipi di interfaccia
622 = Tutti i tipi di interfaccia
623 = Tipi di interfaccia specifici
624 = Local Area Network
625 = Accesso remoto
626 = Wireless
627 = In
628 = Out
629 = Entrambi
640 = attraversamento confini
641 = Impostazioni ICMP
642 = Congelare la prima colonna
680 = Voci
681 = Tutte le voci
682 = Ultima voce
690 = Controllo automatico degli aggiornamenti
691 = Usa configurazione proxy  
692 = Configurazione Proxy
693 = Indirizzo
694 = Nome utente
695 = Password
699 = Processo principale

// Manage Rules

700 = ID processo
701 = Nome
702 = Gruppo
703 = Programma
704 = Posizione
705 = Attivato
706 = Azione
707 = Direzione
708 = Indirizzi locali
709 = Porte locali
710 = Indirizzi remoti
711 = Porte remote
712 = Protocollo
713 = Servizio
714 = Descrizione
715 = Tempo generato
716 = Azioni
717 = Aggiorna elenco
718 = Mostra regole non valide
719 = Cancella registro
720 = Cerca regole
721 = Bloccato di recente
722 = Visualizza registro connessioni Windows Firewall 
723 = Visualizza
724 = Visualizza
725 = Ultime 100 connessioni
726 = Ultime 500 connessioni
727 = Tutti i collegamenti
728 = Connessioni
729 = Colonne di configurazione 
730 = Visualizza
731 = Regole
732 = Tutte le regole
733 = Regole in entrata
734 = Regole in uscita
735 = Regole create dall'utente
736 = Filtro
737 = Nessun filtro
738 = Filtro abilitato
739 = Filtro disattivato
740 = Ricerca
741 = Log connessioni
742 = Politiche
743 = Regole per importare da un file
744 = Esporta tutte le regole
745 = Esporta regole selezionate
746 = Ripristina regole predefinite
747 = Ripristina regole raccomandate
748 = Connessioni ammesse
749 = Connessioni bloccate
750 = Crea nuova regola
751 = Sfoglia per consentire
752 = Click per consentire
753 = Sfoglia per bloccare
754 = Click per bloccare
755 = Consenti a questo programma
756 = Blocca questo programma
757 = Personalizza e permetti ...
758 = Personalizza e blocca ...
759 = Disabilitazione della registrazione per le connessioni bloccate, disabilita anche le notifiche. Sei sicuro di voler continuare?
760 = Opzioni
761 = Consenti
762 = Blocca
763 = Abilita
764 = Disabilita
765 = Elimina
766 = Proprietà
767 = Crea duplicati
768 = Generale
769 = Avanzato
770 = Applica
771 = Protocolli e porte
772 = Indirizzi IP remoti
773 = In ingresso
774 = In uscita
775 = Dominio
776 = Privato
777 = Pubblico
778 = Crea
779 = Esporta le regole selezionate
780 = Qualsiasi
781 = Centri
782 = Porte personalizzate
783 = Indirizzi personalizzati 
784 = Tutti i programmi
785 = Questo programma
786 = Sfoglia ...
787 = Es.: 80,443,9-29
788 = Es.: 50.87.146.202
792 = Si prega di utilizzare il pulsante Aggiorna o F5 per caricare i dati
793 = Attendere ...
794 = Aggiungi a gruppo
795 = Ripristina classificazione
796 = Connessioni
797 = Bloccato di recente
798 = Consentito di recente
799 = Mostra regole duplicate

// Notification Dialog

800 = Connessione in uscita bloccata
801 = Fonte
802 = Remoto
803 = Firmato
804 = IP remoto 
805 = Personalizza questa regola prima di crearla
806 = Consenti questo programma
807 = Permetti sempre di accedere ad Internet 
808 = Blocca questo programma
809 = Blocca sempre di accedere ad Internet
810 = Blocca per ora e chiedi dopo
811 = Applica temporaneamente questa azione
812 = Controlla questo file
813 = Avvia una ricerca WHOIS 
814 = Verifica questo indirizzo IP
815 = Apri il percorso del file
816 = Apri le proprietà del file
817 = Copia il percorso nella clipboard
818 = Saperne di più sullla porta
819 = Torna ai dettagli della regola
823 = Consenti temporaneamente
824 = Blocca temporaneamente
825 = Fino riavvio WFC 
830 = Unisci regole
831 = Regola Incorporata
840 = Applica a tutti i programmi e servizi
841 = Applica ai servizi solo
850 = Indirizzo di origine
851 = Porta di origine
852 = Indirizzo di destinazione
853 = Porta di destinazione

// Validations

920 = Si prega di inserire un nome alla regola
921 = Gli spazi vuoti non sono consentiti
922 = La porta deve avere un valore compreso tra 0 e 65535
923 = Si prega di inserire un range di IP valido
924 = Si prega di inserire un indirizzo IP valido
925 = Parametri duplicati non sono consentiti
926 = Parametri vuoti non sono consentiti
927 = Parametri negativi non sono ammessi
928 = Intervallo di porte valido
929 = Il campo non può essere vuoto
930 = Questo file non esiste
931 = Estensioni supportate
932 = Questo campo deve avere un valore numerico compreso tra 0 e 999
933 = Subnet mask non valido
934 = Questo campo deve avere un valore numerico compreso tra 1 e 60
936 = Regola non valida. Il percorso del programma per il quale è definito questa regola non esiste sul disco.
940 = Impossibile connettersi al Servizio di controllo Windows Firewall

// Uninstall

950 = Disinstalla
951 = Questo rimuove il programma dal computer. Si prega di scegliere quello che si desidera fare con le impostazioni correnti di Windows Firewall:
952 = Ripristina le impostazioni predefinite di Windows Firewall. Le regole create dall'utente verranno eliminate e solo le regole predefinite di Windows Firewall verranno mantenute.
953 = Ripristina lo stato prima dell'installazione di questo programma. Saranno ripristinate tutte le regole precedenti che sono state trovate durante l'installazione del programma.
954 = Mantenere le regole e le impostazioni correnti del firewall. Rimuovere solo questo programma e mantenere tutte le altre impostazioni e le regole come sono in questo momento.
955 = Elimina anche il codice di attivazione
956 = Disabilita la registrazione di Windows Firewall
957 = Disinstallazione in corso...
958 = La disinstallazione non è consentita mentre il programma è bloccato con una password. Si prega di sbloccare il programma e quindi riprovare. Non tentare di forzare la disinstallazione utilizzando un software di terze parti perché rendere Windows Firewall inutilizzabile.